Configuration/InformationRegisters/ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КонтактыРекрутинговыхСайтов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Enums/КонтактыРекрутинговыхСайтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КонтактыРекрутинговыхСайтов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Whatsapp</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Max</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/InformationRegisters/ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов/Ext/ManagerModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(
		Настройки, "ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

// Возвращаемое значение:
//  Структура - Данные:
// * Telegram - СправочникСсылка.ВидыКонтактнойИнформации - 
// * WhatsApp - СправочникСсылка.ВидыКонтактнойИнформации - 
// * Max - СправочникСсылка.ВидыКонтактнойИнформации - 
// * Прочее - СправочникСсылка.ВидыКонтактнойИнформации - 
Функция НовыеДанные() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Telegram", 		Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	Результат.Вставить("WhatsApp", 		Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	Результат.Вставить("Max", 			Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	Результат.Вставить("Прочее", 		Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//  см. НовыеДанные
Функция Данные() Экспорт
	Результат = НовыеДанные();
	
	Данные = СоздатьНаборЗаписей();
	Данные.Прочитать();
	
	Для Каждого Запись Из Данные Цикл
		Если Запись.Контакт = Перечисления.КонтактыРекрутинговыхСайтов.Telegram Тогда
			Результат.Telegram = Запись.ВидКонтактнойИнформации;
		ИначеЕсли Запись.Контакт = Перечисления.КонтактыРекрутинговыхСайтов.WhatsApp Тогда
			Результат.WhatsApp = Запись.ВидКонтактнойИнформации;
		ИначеЕсли Запись.Контакт = Перечисления.КонтактыРекрутинговыхСайтов.Max Тогда
			Результат.Max = Запись.ВидКонтактнойИнформации;
		ИначеЕсли Запись.Контакт = Перечисления.КонтактыРекрутинговыхСайтов.Прочее Тогда
			Результат.Прочее = Запись.ВидКонтактнойИнформации;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Параметры:
//  Данные - см. НовыеДанные
Процедура Сохранить(Данные) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Контакт = Перечисления.КонтактыРекрутинговыхСайтов.Telegram;
	НоваяЗапись.ВидКонтактнойИнформации = Данные.Telegram;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Контакт = Перечисления.КонтактыРекрутинговыхСайтов.WhatsApp;
	НоваяЗапись.ВидКонтактнойИнформации = Данные.WhatsApp;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Контакт = Перечисления.КонтактыРекрутинговыхСайтов.Max;
	НоваяЗапись.ВидКонтактнойИнформации = Данные.Max;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Контакт = Перечисления.КонтактыРекрутинговыхСайтов.Прочее;
	НоваяЗапись.ВидКонтактнойИнформации = Данные.Прочее;
	
	НаборЗаписей.Записать();
КонецПроцедуры

// Параметры:
//  Контакт - ПеречислениеСсылка.КонтактыРекрутинговыхСайтов
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации
Функция ТекущийВидКонтактнойИнформации(Контакт) Экспорт
	Результат = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Контакт) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Контакт.Установить(Контакт);
	Набор.Прочитать();
	
	Для Каждого Запись Из Набор Цикл
		Результат = Запись.ВидКонтактнойИнформации;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
